# CutMarkSymbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CutMarkType..::..CutMarkSymbol Property
CutMarkType Class See Also
---
The symbol type of the cut mark.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CutMarkSymbol CutMarkSymbol { get; set; }
```

Visual Basic
---
```text
Public Property CutMarkSymbol As CutMarkSymbol
	Get
	Set
```

Visual C++
---
```text
public:
property CutMarkSymbol CutMarkSymbol {
	CutMarkSymbol get ();
	void set (CutMarkSymbol value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace